GetLabelOutline Method
 Gets the outline viewport's label on the sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Outline GetLabelOutline()
Visual Basic
Public Function GetLabelOutline As Outline
Visual C++
public:
Outline^ GetLabelOutline()
Return Value
 The outline of the viewport's label on the sheet. The outline may be empty if there is no label.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  The viewport is not on a sheet.
See Also
Viewport Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →